# Базовый размер клетки
CELL_SIZE_BASE = 10

# Текущий размер клетки
CELL_SIZE = 1

# Размеры окна приложения в пикселях
WIDTH = 80 * CELL_SIZE_BASE // CELL_SIZE
HEIGHT = 80  * CELL_SIZE_BASE // CELL_SIZE

# Цвета
COLOR_LINE = (200, 200, 200)
WHITE = (255, 255, 255)
GRAY = (127, 127, 127)
GREEN = (0, 255, 0)
BLUE = (0, 0, 255)
BLACK = (0, 0, 0)
RED = (255, 0, 0)


PALETTE_COLORS = [
    (200, 200, 200), # Светло-серый
    (20, 20, 20), # Почти чёрный
    (255, 255, 255), # Белый
    (0, 255, 0), # Зелёный
    (255, 0, 0), # Красный
    (0, 0, 255), # Синий
    (255, 0, 255), # Фиолетовый
    (255, 192, 203) # Розовый
]